{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Golpes Baseados Em Relacionamento",
    "1": "Golpes de Ganho Financeiro Ilus\u00f3rio",
    "2": "Ataques de Phishing e Roubo de Dados",
    "3": "Fraudes em Lojas Virtuais Falsas",
    "4": "Golpes de Desinforma\u00e7\u00e3o Digital",
    "5": "Seguro"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Ataques de Phishing e Roubo de Dados": 2,
    "Fraudes em Lojas Virtuais Falsas": 3,
    "Golpes Baseados Em Relacionamento": 0,
    "Golpes de Desinforma\u00e7\u00e3o Digital": 4,
    "Golpes de Ganho Financeiro Ilus\u00f3rio": 1,
    "Seguro": 5
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 29794
}
